/**
 * @mainpage
 * # Загальне завдання
 * Підрахувати суму чисел у заданому діапазоні. Наприклад, при вхідних даних 
 * 50 та 52 повинно бути 50+51+52=153.
 *
 * @author Khelemendyk
 * @date 22-sep-2021
 */

/** #include "lib.h" */

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - створення змінних a, b, c.
 * - у змінній с лежить кількість чисел у заданому діапазоні
 * - створюю змінну res, у якій буде результат рахуватися за заданою формулою
 */
int main()
{
	int a, b, c;
	a = 1;
	b = 7;
	c = (b - a) + 1;
	int res = (a + b) * c / 2;
}
