#ifndef LAB_15_ENTITY_H
#define LAB_15_ENTITY_H

/**
 * @file entity.h
 * @brief Файл з описом функцій: меню взаємодії з користувачем,
 * знаходження згорілих лампочок, сортування за критерієм, виводом у консоль
 * всіх лампочок та записом лампочки у структуру Bulb для подальшого тестування.
 *
 * @author Khelemendyk D.
 * @date 01-may-2022
 * @version 0.1
 */

#include "list.h"

/**
 * Меню взаємодії з користувачем.
 *
 * Функція запитує у користувача який саме функціонал він хоче виконати.
 * Повертає номер функції.
 */
int get_answer();
/**
 * Чи згоріла лампочка?
 *
 * Функція перевіряє чи згоріла хоча б одна одна лампочка.
 * Отримує показчик на контейнер.
 * Повертає 1, якщо хоча б одна лампочка згоріла.
 */
int is_burned_bulb(struct Container *container);
/**
 * Друк згорівших лампочок.
 *
 * Функція друкує згорівші лампочки.
 * Отримує показчик на структуру та кількість лампочок.
 */
void print_burned_bulbs(struct Container *cont);
/**
 * Знаходження згорівших лампочок.
 *
 * Функція перевіряє чи є лампочки взагалі, якщо є - перевіряє 
 * на наявність згорівшої лампочки функцією is_burned_bulb, 
 * та при наявності хоча б однієї згорівшої лампочки - друкує її 
 * за допомогою функції print_burned_bulbs.
 * Отримує показчик на контейнер.
 */
void find_burned_bulbs(struct Container *container);
/**
 * Сортування лампочок за критерієм.
 *
 * Функція запитує критерій для сортування та друкує 
 * відсортованні лампочки.
 * Отримує показчик на контейнер.
 */
void sort_by_criterion(struct Container *cont);
/**
 * Друк лампочок.
 *
 * Функція друкує лампочки, якщо вони є.
 * Отримує показчик на контейнер.
 */
void print_bulbs(struct Container *cont);

#endif