#ifndef LAB_15_LIST_H
#define LAB_15_LIST_H

/**
 * @file list.h
 * @brief Файл з описом функцій: заповнення лампочки, отримання позиції
 * для додавання та видалення елемента, додавання та видалення лампочки
 * у динамічному масиві.
 *
 * @author Khelemendyk D.
 * @date 01-may-2022
 * @version 0.1
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/**
 * Структура "лампочка"
 */
struct Bulb {
	char is_on[5];
	char is_burned[5];
	char factory[30];
	int reverse_counter;
	int vatt;
	int color_temp;
	char shape[15];
	char base_type[10];
};
/**
 * Структура "контейнер". Зберігає структуру "лампочка"
 * та її розмір.
 */
struct Container {
	struct Bulb *bulbs;
	size_t size;
};
/**
 * Заповнення структури.
 *
 * Функція запитує у користувача дані та записує їх у структуру.
 * Отримує показчик на структуру.
 */
void get_bulb(struct Bulb *e);
/**
 * Отримання позиції для додавання елемента у контейнер.
 *
 * Функція запитує у користувача в яку позицію записати елемент 
 * у контейнер, якщо він не нульовий.
 * Отримує розмір структури.
 */
size_t get_position_to_add(size_t size);
/**
 * Отримання позиції для видалення елемента з контейнера.
 *
 * Функція запитує у користувача в який елемент видалити 
 * у контейнері.
 * Отримує розмір структури.
 */
size_t get_position_to_remove(size_t size);
/**
 * Додавання лампочки у контейнер.
 *
 * Функція виділяє пам'ять для більшого масива, переписує 
 * в нього старі лампочки(якщо вони є) та додає нову лампочку.
 * Отримує показчик на контейнер, позицію для додавання, 
 * показчик на елемент.
 */
void insert_bulb(struct Container *container, size_t pos, struct Bulb *bulb);
/**
 * Видалення елемента з контейнера.
 *
 * Функція видаляє елемент з контейнера.
 * Отримує показчик на контейнер, позицію для видалення.
 */
void remove_bulb(struct Container *container, size_t pos);
#endif