#ifndef LAB_10_LIB_H
#define LAB_10_LIB_H

/**
 * @file lib.h
 * @brief Файл з описом функцій заповнення масиву, знаходження діагоналі
 * та сортування
 *
 * @author Khelemendyk D.
 * @date 29-dec-2021
 */
#include <stdlib.h>
#include <time.h>
/**
 * Розмір масиву
 */
#define N 3
/**
 * Заповнення масиву.
 *
 * Функція заповнює двовимірний масив рандомними числами від 0 до 100.
 */
void push(int **arr1, int n);

/**
 * Отримання діагоналі.
 *
 * Функція заповнює масив числами, які знаходяться на діагоналі іншого
 * двовимірного масиву. Отримує два масива та {@link N}(для визначення кількості
 * елементів на діагоналі).
 */
void get_diagonal(int **arr1, int *arr2, int n);

/**
 * Функція, яка потрібна для сортування елементів в масиві.
 */
int cmp(const void *a, const void *b);

#endif
