/**
 * @mainpage
 * # Загальне завдання
 * 25. Дано двовимірний масив з 𝑁×𝑁 цілих чисел. Виконати циклічне зрушення 
 * елементів рядків масиву в напрямку справа наліво (перший елемент рядка 
 * повинен переміститися в її кінець).
 *
 * @author Khelemendyk D.
 * @date 21-oct-2021
 */

/** #include "lib.h" */
int main()
{
	// константи, які є розміром масиву
#define A 2
#define B 3
	int matrix[A][B];
	// заповнюю масив від 1 до n
	for (int i = 0; i < A; i++) {
		for (int j = 0; j < B; j++) {
			int n = i * B + j + 1;
			matrix[i][j] = n;
		}
	}
	// присвоюю значення 1 елемента масиву в тимчасову зміну
	int tmp = matrix[0][0];
	// виконую зсув справа наліво
	for (int n = 0; n < A; n++) {
		for (int p = 0; p < B; p++) {
			matrix[n][p] = matrix[n][p + 1];
		}
	}
	// присвоюю останньому елементу значення tmp
	matrix[1][2] = tmp;
	return 0;
}
