#ifndef LAB_13_LIB_H
#define LAB_13_LIB_H

/**
 * @file lib.h
 * @brief Файл з описом функції, яка виводить дані про структуру файлів та
 * каталогів.
 *
 * @author Khelemendyk D.
 * @date 14-jan-2022
 * @version 0.1
 */
#include <dirent.h>
#include <stdio.h>
#include <stdlib.h>

/**
 * Отримання розміру файла, з якого будуть зчитані дані. 
 *
 * Функція визначає розмір файла з вхідними даними. Приймає один аргумент:
 * argv(зберігає дані кожного аргумента).
 */
int size_of_file(char *argv[]);

/**
 * Отримання вхідних даних
 *
 * Функція зчитує вхідні дані та записує їх в буфер. Приймає два аргумента:
 * buff(буфер) та argv(зберігає дані кожного аргументу).
 */
void read_from_file(char *buff, char *argv[]);

/**
 * Отримання даних про файли та каталоги заданої директорії, друкує та записує
 * їх в заданий файл.
 *
 * Функція приймає два аргумента: argc(кількість заданих аргументів
 * користувачем) та argv(зберігає дані кожного аргументу).
 */
void open_dir_and_write_output(char *buff, char *argv[]);

#endif
