#ifndef LAB_16_LIST_H
#define LAB_16_LIST_H

/**
 * @file list.h
 * @brief Файл з описом функцій: отримання позиції для додавання 
 * та видалення елемента, додавання та видалення лампочки 
 * у двозв'язному списку, знаходження згорілих лампочок, 
 * сортування за критерієм, виводом у консоль всіх лампочок.
 *
 * @author Khelemendyk D.
 * @date 22-may-2022
 * @version 0.1
 */

#include "entity.h"

/**
 * Структура "елемент". Зберігає струтуру "лампочка" та 
 * показчик на наступний та попередній елемент.
 */
struct Element {
	struct Bulb *bulb;
	struct Element *next;
};

/**
 * Структура "список". Зберігає структуру "елемент"
 * та розмір списка.
 */
struct List {
	struct Element *head;
	size_t size;
};

/**
 * Отримання позиції для додавання елемента у контейнер.
 *
 * Функція запитує у користувача в яку позицію записати елемент 
 * у контейнер, якщо він не нульовий.
 * Отримує розмір структури.
 */
size_t get_position_to_add(size_t size);
/**
 * Отримання позиції для видалення елемента з контейнера.
 *
 * Функція запитує у користувача в який елемент видалити 
 * у контейнері.
 * Отримує розмір структури.
 */
size_t get_position_to_remove(size_t size);
/**
 * Отримання позиції для видалення елемента з контейнера.
 *
 * Функція запитує у користувача в який елемент видалити 
 * у контейнері.
 * Отримує розмір структури.
 */
struct Element *get_element_by_pos(struct List *list, size_t pos);
/**
 * Додавання лампочки у контейнер.
 *
 * Функція виділяє пам'ять для більшого масива, переписує 
 * в нього старі лампочки(якщо вони є) та додає нову лампочку.
 * Отримує показчик на контейнер, позицію для додавання, 
 * показчик на елемент.
 */
void insert_bulb(struct List *list, size_t pos, struct Bulb *bulb);
/**
 * Видалення елемента з контейнера.
 *
 * Функція видаляє елемент з контейнера.
 * Отримує показчик на контейнер, позицію для видалення.
 */
void remove_bulb(struct List *list, size_t pos);
/**
 * Друк згорівших лампочок.
 *
 * Функція друкує згорівші лампочки.
 * Отримує показчик на структуру та кількість лампочок.
 */
int print_burned_bulbs(struct List *list);
/**
 * Знаходження згорівших лампочок.
 *
 * Функція перевіряє чи є лампочки взагалі, якщо є - перевіряє 
 * на наявність згорівшої лампочки функцією is_burned_bulb, 
 * та при наявності хоча б однієї згорівшої лампочки - друкує її 
 * за допомогою функції print_burned_bulbs.
 * Отримує показчик на контейнер.
 */
void find_burned_bulbs(struct List *list);
/**
 * Сортування лампочок за критерієм.
 *
 * Функція запитує критерій для сортування та друкує 
 * відсортованні лампочки.
 * Отримує показчик на контейнер.
 */
void sort_by_criterion(struct List *list);
/**
 * Друк лампочок.
 *
 * Функція друкує лампочки, якщо вони є.
 * Отримує показчик на контейнер.
 */
void print_bulbs(struct List *list);
/**
 * Друк лампочок.
 *
 * Функція друкує лампочки, якщо вони є.
 * Отримує показчик на контейнер.
 */
void clean_up(struct List *list);

#endif