/**
 * @mainpage
 * # Загальне завдання
 * Визначити, у скільки разів значення дробової частини числа більше за цілу.
 * Організувати перевірку ділення на 0. Результат “обрізати” до другого знака
 * після  коми. Наприклад, 𝑥=123.656-> 𝑦 =656/123=5.333333=5.330000.
 *
 *
 * @author Khelemendyk D.
 * @date 29-sep-2021
 */

/** #include "lib.h" */

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - створення змінної a = 123.656.
 * - за допомогою if виконую перевірку ділення на 0.
 * - далі створюю змінні b, c, d, та res.
 * - змінна b присвоює значення цілої частини змінної а, змінна c - дробової.
 * - змінна d присвоює ділення змінних c та b. Також множу на 100.
 * - далі створюю змфнну f, яка присвоює значення цілої частини змінної d.
 * - змінна res “обрізає” результат до другого знака після коми.
 */
int main()
{
	float a = 123.656f;
	if (a > 1) {
		int b = (int)a;
		float c = (a - (float)b) * 1000;
		float d = c / (float)b;
		d *= 100;
		int f = (int)d;
		double res = (float)f / 100.0;
	} else {
		return 0;
	}
}
