/**
 * @file lib.c
 * @brief Файл з реалізацією функцій знаходження розміру матриці,
 * ввод її даних, отримання оберненної матриці та друку матриці.
 *
 * @author Khelemendyk D.
 * @date 03-jan-2022
 */

#include "lib.h"
char buffer[N];
int size_of_matrix()
{
	char s[] = "Input the size of matrix NxN (max:4): ";
	int size = 0;
	while (size <= 1 || size > 4) { // перевірка на розмір
		write(1, &s, strlen(s));
		read(2, buffer, N);
		size = atoi(buffer);
	}
	return size;
}
void input_matrix(float **mtx, int size)
{
	char s[] = "Input your matrix ";
	for (int r = 0; r < size; r++) {
		for (int c = 0; c < size; c++) {
			write(1, &s, strlen(s));
			char row = (char)r + '1';
			char column = (char)c + '1';
			write(1, &row, 1);
			write(1, " ", 1);
			write(1, &column, 1);
			write(1, ": ", 2);
			read(2, buffer, N);
			*(*(mtx + r) + c) = (float)atof(buffer);
		}
	}
}
int inverse_matrix(float **mtx, float **mtx_res, int size)
{
	float det = 0;
	if (size == 2) {
		det = *(*(mtx + 0) + 0) * *(*(mtx + 1) + 1) - (*(*(mtx + 1) + 0) * *(*(mtx + 0) + 1)); // визначник
		if (det == 0.0) {
			return 1;
		} else {
			// знаходимо мінори, транспонуємо матрицю та ділимо її на визначник;
			// отримуємо обернену матрицю
			*(*(mtx_res + 0) + 0) = *(*(mtx + 1) + 1) / det;
			*(*(mtx_res + 0) + 1) = (*(*(mtx + 0) + 1) * -1) / det;
			*(*(mtx_res + 1) + 0) = (*(*(mtx + 1) + 0) * -1) / det;
			*(*(mtx_res + 1) + 1) = *(*(mtx + 0) + 0) / det;
		}
	} else if (size == 3) {
		// шукає визначник 3-го порядку
		float x = *(*(mtx + 0) + 0) * (*(*(mtx + 1) + 1) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 1) * *(*(mtx + 1) + 2)));
		float y = *(*(mtx + 0) + 1) * (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 2)));
		float z = *(*(mtx + 0) + 2) * (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 1) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 1)));
		det = x - y + z; // визначник
		if (det == 0.0) {
			return 1;
		} else {
			// знаходе мінори, транспонує матрицю та діле її на визначник;
			// отримуємо обернену матрицю
			*(*(mtx_res + 0) + 0) = (*(*(mtx + 1) + 1) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 1) * *(*(mtx + 1) + 2))) / det;
			*(*(mtx_res + 0) + 1) = (*(*(mtx + 0) + 1) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 1) * *(*(mtx + 0) + 2))) / det * -1;
			*(*(mtx_res + 0) + 2) = (*(*(mtx + 0) + 1) * *(*(mtx + 1) + 2) - (*(*(mtx + 1) + 1) * *(*(mtx + 0) + 2))) / det;
			*(*(mtx_res + 1) + 0) = (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 2))) / det * -1;
			*(*(mtx_res + 1) + 1) = (*(*(mtx + 0) + 0) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 0) * *(*(mtx + 0) + 2))) / det;
			*(*(mtx_res + 1) + 2) = (*(*(mtx + 0) + 0) * *(*(mtx + 1) + 2) - (*(*(mtx + 1) + 0) * *(*(mtx + 0) + 2))) / det * -1;
			*(*(mtx_res + 2) + 0) = (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 1) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 1))) / det;
			*(*(mtx_res + 2) + 1) = (*(*(mtx + 0) + 0) * *(*(mtx + 2) + 1) - (*(*(mtx + 2) + 0) * *(*(mtx + 0) + 1))) / det * -1;
			*(*(mtx_res + 2) + 2) = (*(*(mtx + 0) + 0) * *(*(mtx + 1) + 1) - (*(*(mtx + 1) + 0) * *(*(mtx + 0) + 1))) / det;
		}
	} else if (size == 4) {
		// шукає визначник 3-го порядку
		float x1 = *(*(mtx + 1) + 1) * (*(*(mtx + 2) + 2) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 2) * *(*(mtx + 2) + 3)));
		float y1 = *(*(mtx + 1) + 2) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 1) * *(*(mtx + 2) + 3)));
		float z1 = *(*(mtx + 1) + 3) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 1) * *(*(mtx + 2) + 2)));
		// 1/4 визначика 4-го порядку
		float a = *(*(mtx + 0) + 0) * (x1 - y1 + z1);
		// шукає визначник 3-го порядку
		float x2 = *(*(mtx + 1) + 0) * (*(*(mtx + 2) + 2) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 2) * *(*(mtx + 2) + 3)));
		float y2 = *(*(mtx + 1) + 2) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 3)));
		float z2 = *(*(mtx + 1) + 3) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 2)));
		// 2/4 визначика 4-го порядку
		float b = *(*(mtx + 0) + 1) * (x2 - y2 + z2);
		// шукає визначник 3-го порядку
		float x3 = *(*(mtx + 1) + 0) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 1) * *(*(mtx + 2) + 3)));
		float y3 = *(*(mtx + 1) + 1) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 3)));
		float z3 = *(*(mtx + 1) + 3) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 1) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 1)));
		// 3/4 визначика 4-го порядку
		float c = *(*(mtx + 0) + 2) * (x3 - y3 + z3);
		// шукає визначник 3-го порядку
		float x4 = *(*(mtx + 1) + 0) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 1) * *(*(mtx + 2) + 2)));
		float y4 = *(*(mtx + 1) + 1) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 2)));
		float z4 = *(*(mtx + 1) + 2) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 1) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 1)));
		// 4/4 визначика 4-го порядку
		float d = *(*(mtx + 0) + 3) * (x4 - y4 + z4);
		det = a - b + c - d; // визначник
		if (det == 0.0) {
			return 1;
		} else {
			// шукає визначники 3-го порядку
			float x5 = *(*(mtx + 0) + 1) * (*(*(mtx + 2) + 2) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 2) * *(*(mtx + 2) + 3)));
			float y5 = *(*(mtx + 0) + 2) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 1) * *(*(mtx + 2) + 1)));
			float z5 = *(*(mtx + 0) + 3) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 1) * *(*(mtx + 2) + 2)));
			float x6 = *(*(mtx + 0) + 0) * (*(*(mtx + 2) + 2) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 2) * *(*(mtx + 2) + 3)));
			float y6 = *(*(mtx + 0) + 2) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 3)));
			float z6 = *(*(mtx + 0) + 3) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 2)));
			float x7 = *(*(mtx + 0) + 0) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 1) * *(*(mtx + 2) + 3)));
			float y7 = *(*(mtx + 0) + 1) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 3)));
			float z7 = *(*(mtx + 0) + 3) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 1) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 1)));
			float x8 = *(*(mtx + 0) + 0) * (*(*(mtx + 2) + 1) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 1) * *(*(mtx + 2) + 2)));
			float y8 = *(*(mtx + 0) + 1) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 2)));
			float z8 = *(*(mtx + 0) + 2) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 1) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 1)));
			float x9 = *(*(mtx + 0) + 1) * (*(*(mtx + 1) + 2) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 2) * *(*(mtx + 1) + 3)));
			float y9 = *(*(mtx + 0) + 2) * (*(*(mtx + 1) + 1) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 1) * *(*(mtx + 1) + 3)));
			float z9 = *(*(mtx + 0) + 3) * (*(*(mtx + 1) + 1) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 1) * *(*(mtx + 1) + 2)));
			float x10 = *(*(mtx + 0) + 0) * (*(*(mtx + 1) + 2) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 2) * *(*(mtx + 1) + 3)));
			float y10 = *(*(mtx + 0) + 2) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 3)));
			float z10 = *(*(mtx + 0) + 3) * (*(*(mtx + 2) + 0) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 0) * *(*(mtx + 2) + 2)));
			float x11 = *(*(mtx + 0) + 0) * (*(*(mtx + 1) + 1) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 1) * *(*(mtx + 1) + 3)));
			float y11 = *(*(mtx + 0) + 1) * (*(*(mtx + 1) + 0) * *(*(mtx + 3) + 3) - (*(*(mtx + 3) + 0) * *(*(mtx + 1) + 3)));
			float z11 = *(*(mtx + 0) + 3) * (*(*(mtx + 1) + 0) * *(*(mtx + 3) + 1) - (*(*(mtx + 3) + 0) * *(*(mtx + 1) + 1)));
			float x12 = *(*(mtx + 0) + 0) * (*(*(mtx + 1) + 1) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 1) * *(*(mtx + 1) + 2)));
			float y12 = *(*(mtx + 0) + 1) * (*(*(mtx + 1) + 0) * *(*(mtx + 3) + 2) - (*(*(mtx + 3) + 0) * *(*(mtx + 1) + 2)));
			float z12 = *(*(mtx + 0) + 2) * (*(*(mtx + 1) + 0) * *(*(mtx + 3) + 1) - (*(*(mtx + 3) + 0) * *(*(mtx + 1) + 1)));
			float x13 = *(*(mtx + 0) + 1) * (*(*(mtx + 1) + 2) * *(*(mtx + 2) + 3) - (*(*(mtx + 2) + 2) * *(*(mtx + 1) + 3)));
			float y13 = *(*(mtx + 0) + 2) * (*(*(mtx + 1) + 1) * *(*(mtx + 2) + 3) - (*(*(mtx + 2) + 1) * *(*(mtx + 1) + 3)));
			float z13 = *(*(mtx + 0) + 3) * (*(*(mtx + 1) + 1) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 1) * *(*(mtx + 1) + 2)));
			float x14 = *(*(mtx + 0) + 0) * (*(*(mtx + 1) + 2) * *(*(mtx + 2) + 3) - (*(*(mtx + 2) + 2) * *(*(mtx + 1) + 3)));
			float y14 = *(*(mtx + 0) + 2) * (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 3) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 3)));
			float z14 = *(*(mtx + 0) + 3) * (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 3) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 2)));
			float x15 = *(*(mtx + 0) + 0) * (*(*(mtx + 1) + 1) * *(*(mtx + 2) + 3) - (*(*(mtx + 2) + 1) * *(*(mtx + 1) + 3)));
			float y15 = *(*(mtx + 0) + 1) * (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 3) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 3)));
			float z15 = *(*(mtx + 0) + 3) * (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 1) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 1)));
			float x16 = *(*(mtx + 0) + 0) * (*(*(mtx + 1) + 1) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 1) * *(*(mtx + 1) + 2)));
			float y16 = *(*(mtx + 0) + 1) * (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 2) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 2)));
			float z16 = *(*(mtx + 0) + 2) * (*(*(mtx + 1) + 0) * *(*(mtx + 2) + 1) - (*(*(mtx + 2) + 0) * *(*(mtx + 1) + 1)));
			// знаходе мінори, транспонує матрицю та діле її на визначник;
			// отримуємо обернену матрицю
			*(*(mtx_res + 0) + 0) = (x1 - y1 + z1) / det;
			*(*(mtx_res + 0) + 1) = (-x5 + y5 - z5) / det;
			*(*(mtx_res + 0) + 2) = (x9 - y9 + z9) / det;
			*(*(mtx_res + 0) + 3) = (-x13 + y13 - z13) / det;
			*(*(mtx_res + 1) + 0) = (-x2 + y2 - z2) / det;
			*(*(mtx_res + 1) + 1) = (x6 - y6 + z6) / det;
			*(*(mtx_res + 1) + 2) = (-x10 + y10 - z10) / det;
			*(*(mtx_res + 1) + 3) = (x14 - y14 + z14) / det;
			*(*(mtx_res + 2) + 0) = (x3 - y3 + z3) / det;
			*(*(mtx_res + 2) + 1) = (-x7 + y7 - z7) / det;
			*(*(mtx_res + 2) + 2) = (x11 - y11 + z11) / det;
			*(*(mtx_res + 2) + 3) = (-x15 + y15 - z15) / det;
			*(*(mtx_res + 3) + 0) = (-x4 + y4 - z4) / det;
			*(*(mtx_res + 3) + 1) = (x8 - y8 + z8) / det;
			*(*(mtx_res + 3) + 2) = (-x12 + y12 - z12) / det;
			*(*(mtx_res + 3) + 3) = (x16 - y16 + z16) / det;
		}
	}
	return 0;
}
void print_array(float **mtx, int size, int num)
{
	char s1[] = "\nIt's your start matrix:\n\n";
	char s2[] = "\nIt's your final matrix:\n\n";
	if (num == 1) {
		write(1, &s1, strlen(s1));
	} else if (num == 2) {
		write(1, &s2, strlen(s2));
	}
	for (int r = 0; r < size; r++) { // друкує матрицю
		write(1, "( ", 2);
		for (int c = 0; c < size; c++) {
			snprintf(buffer, sizeof(buffer), "%7.2f ", *(*(mtx + r) + c));
			write(1, &buffer, N);
		}
		write(1, ")\n", 3);
	}
}
