#ifndef LAB_11_LIB_H
#define LAB_11_LIB_H

/**
 * @file lib.h
 * @brief Файл з описом функцій знаходження розміру матриці,
 * ввод її даних, отримання оберненної матриці та друку матриці.
 *
 * @author Khelemendyk D.
 * @date 03-jan-2022
 */
#include <unistd.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

/**
 * Розмір буферу
 */
#define N 1000

/**
 * Отримання даних про розмір матриці.
 *
 * Функція запитує у користувача розмір матриці, який повинен бути 
 * від 2 до 4 включно.
 */
int size_of_matrix();

/**
 * Заповнення матриці.
 *
 * Функція запитує у користувача дані матриці та заповнює її ціма значеннями.
 * Отримує показник матриці та її розмір.
 */
void input_matrix(float **mtx, int size);

/**
 * Обернена матриця.
 *
 * Функція розраховує обернену матрицю та записує її в результуючу матрицю.
 * Отримує два показника матриць(один для початкової матриці, інший - кінцевої)
 * та їхній розмір. 
 */
int inverse_matrix(float **mtx, float **mtx_res, int size);

/**
 * Друк матриці.
 *
 * Функція друкує матрицю. Отримує показник матриці, її розмір та номер(так як
 * програма розрахована на дві матриці, то номер 1 - для друку початкової
 * матриці, а 2 - для оберненної).
 */
void print_array(float **mtx, int size, int num);

#endif
