#ifndef LAB_14_LIB_H
#define LAB_14_LIB_H

/**
 * @file lib.h
 * @brief Файл з описом функцій: заповнення структури, рахувальник строк,
 * знаходження найдовшої строки, заповнення структур та знаходження критерію
 * для сортування, знаходження кількості згорівших лампочок, запис номерів
 * згорівших лампочок, друк результату у консоль, запис результату у файл.
 *
 * @author Khelemendyk D.
 * @date 11-apr-2022
 * @version 0.1
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/**
 * Структура "лампочка"
 */
struct Bulb {
	char is_on[5];
	char is_burned[5];
	char factory[30];
	int reverse_counter;
	int vatt;
	int color_temp;
	char shape[15];
	char base_type[10];
};

/**
 * Рахувальник строк.
 *
 * Функція рахує кількість строк у файлі. Отримує масив з аргументом(введений
 * користувачем).
 */
int count_lines(char *argv[]);

/**
 * Заповнення структур та отримання критерія для сортування.
 *
 * Функція зчитує дані з файла, заповнює масив структур та записує у показчик
 * критерій для сортування за його наявності. Отримує структуру, кількість
 * лампочок, масив з аргументом(введений користувачем), та критерій для
 * сортування.
 */
int get_struct_and_criterion(struct Bulb *bulbs, int number_bulbs, char *argv[], char *criterion_for_sorting);

/**
 * Найдовша строка.
 *
 * Функція знаходе кількість символів у найдовшій строці. Отримує масив з
 * аргументом(введений користувачем).
 */
int max_string_length(char *argv[]);

/**
 * Заповнення структури.
 *
 * Функція розбиває строку на частини та записує дані у структуру.
 * Отримує строку, роздільник та структуру.
 */
int write_to_struct(char *string, const char *delim, struct Bulb *bulbs);

/**
 * Чи згорівша лампочка.
 *
 * Функція рахує кількість згорівших лампочок. Отримує структуру та кількість
 * лампочок.
 */
int is_burned_bulb(struct Bulb *bulbs, int number_bulbs);

/**
 * Знайти згорівшу лампочку та записати її номер.
 *
 * Функція знаходе номера згорівших лампочок та записує їх у показчик. Отримує
 * структуру, кількість лампочок та показчик
 */
void get_index_burned_bulbs(struct Bulb *bulbs, int number_bulbs, int *burned_bulbs);

/**
 * Друк результату у консоль.
 *
 * Функція друкує результат у вікно консолі. Отримує структуру, кількість
 * лампочок, показчик з номерами згорівших лампочок, кількість згорівших
 * лампочок та критерій для сортування.
 */
void print_res_screen(struct Bulb *bulbs, int number_bulbs, int *burned_bulbs, int number_burned_bulbs, char *criterion_for_sorting);

/**
 * Друк результату у файл.
 *
 * Функція друкує результат у файл. Отримує структуру, кількість
 * лампочок, показчик з номерами згорівших лампочок, кількість згорівших
 * лампочок, критерій для сортування та масив з аргументами(введеними
 * користувачем).
 */
void print_res_file(struct Bulb *bulbs, int number_bulbs, int *burned_bulbs, int number_burned_bulbs, char *criterion_for_sorting, char *argv[]);

#endif
