#ifndef LAB_14_LIB_H
#define LAB_14_LIB_H

/**
 * @file lib.h
 * @brief Файл з описом функцій: заповнення структури, рахувальник строк,
 * знаходження найдовшої строки, заповнення структур та знаходження критерію
 * для сортування, знаходження кількості згорівших лампочок, запис номерів
 * згорівших лампочок, друк результату у консоль, запис результату у файл.
 *
 * @author Khelemendyk D.
 * @date 20-jan-2022
 * @version 0.1
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <ctype.h>

/**
 * Структура "лампочка"
 */
struct bulb {
	char is_on[5];
	char is_burn[5];
	char factory[30];
	int reverse_cntr;
	int vatt;
	int temp;
	char form[15];
	char type_plinth[10];
};

/**
 * Заповнення структури.
 *
 * Функція розбиває строку на частини та записує дані у структуру.
 * Отримує строку, роздільник та структуру.
 */
int write_to_struct(char *s, const char *delim, struct bulb *e);

/**
 * Рахувальник строк.
 *
 * Функція рахує кількість строк у файлі. Отримує масив з аргументом(введений
 * користувачем).
 */
int lines_count(char *argv[]);

/**
 * Найдовша строка.
 *
 * Функція знаходе кількість символів у найдовшій строці. Отримує масив з
 * аргументом(введений користувачем).
 */
int longest_line(char *argv[]);

/**
 * Заповнення структур та отримання критерія для сортування.
 *
 * Функція зчитує дані з файла, заповнює масив структур та записує у показчик
 * критерій для сортування за його наявності. Отримує структуру, кількість
 * лампочок, масив з аргументом(введений користувачем), та критерій для
 * сортування.
 */
int get_struct_and_type(struct bulb *bulbs, int count_bulbs, char *argv[], char *type_for_sort);

/**
 * Чи згорівша лампочка.
 *
 * Функція рахує кількість згорівших лампочок. Отримує структуру та кількість
 * лампочок.
 */
int is_burn_bulbs(struct bulb *bulbs, int count_bulbs);

/**
 * Знайти згорівшу лампочку та записати її номер.
 *
 * Функція знаходе номера згорівших лампочок та записує їх у показчик. Отримує
 * структуру, кількість лампочок та показчик
 */
void find_burn_bulbs(struct bulb *bulbs, int count_bulbs, int *burn_bulbs);

/**
 * Друк результату у консоль.
 *
 * Функція друкує результат у вікно консолі. Отримує структуру, кількість
 * лампочок, показчик з номерами згорівших лампочок, кількість згорівших
 * лампочок та критерій для сортування.
 */
void print_res_screen(struct bulb *bulbs, int count_bulbs, int *burn_bulbs, int num_burn_bulbs, char *type_for_sort);

/**
 * Друк результату у файл.
 *
 * Функція друкує результат у файл. Отримує структуру, кількість
 * лампочок, показчик з номерами згорівших лампочок, кількість згорівших
 * лампочок, критерій для сортування та масив з аргументами(введеними
 * користувачем).
 */
void print_res_file(struct bulb *bulbs, int count_bulbs, int *burn_bulbs, int num_burn_bulbs, char *type_for_sort, char *argv[]);

#endif
